//============================================================
//
//  title  : データ管理 [DataManager.h]
//  Author : 原田 陽央
//   Date  : 2021/10/05
//  Update : 2021/10/05
//
//============================================================
#pragma once


//============================================================
//　クラス宣言
//============================================================
class DataManager
{
private:

public:
	DataManager();   // コンストラクタ
	~DataManager();  // デストラクタ

	static void DispData(void);          // データを表示
	static void ReadScoreTextFile(void); // テキストファイルを読み込む
};