//============================================================
//
//  title  : データ構造 [main.cpp]
//  Author : 原田 陽央
//   Date  : 2021/10/04
//  Update : 2021/10/06
//
//============================================================
//============================================================
//　インクルード
//============================================================
#include "list.h"
#include "stack.h"


//============================================================
//　関数
//============================================================
//------------------------------------------------------------
//　メイン関数
//------------------------------------------------------------
int main(void)
{
	// 要素を追加
	Stack::Push(0, "Tanaka");
	Stack::Push(1, "Satou");
	Stack::Push(2, "Kobayashi");
	Stack::Push(3, "Kishida");
	Stack::Push(4, "Shimamura");
	Stack::Push(5, "Suga");
	// データを一覧表示
	Stack::Disp();
	// 改行用
	std::cout << "" << endl;
	

	// １回目
	// 要素を取り出す
	Stack::Pop();
	std::cout << "" << endl;
	// データを再度一覧表示
	Stack::Disp();
	// 改行用
	std::cout << "" << endl;


	// ２回目
	// 要素を取り出す
	Stack::Pop();
	std::cout << "" << endl;
	// データを再度一覧表示
	Stack::Disp();
}
