//============================================================
//
//  title  : データ構造 [main.cpp]
//  Author : 原田 陽央
//   Date  : 2021/10/04
//  Update : 2021/10/06
//
//============================================================
//============================================================
//　インクルード
//============================================================
#include "DoublyLinkedList.h"
#include "stack.h"


//============================================================
//　関数
//============================================================
//------------------------------------------------------------
//　メイン関数
//------------------------------------------------------------
int main(void)
{
	// スタックの生成
	Stack testStack;

	// 要素を入力
	RecordData pushData[6] =
	{
		0, "Tanaka",
		1, "Satou",
		2, "Kobayashi",
		3, "Kishida",
		4, "Shimamura",
		5, "Suga"
	};

	// 要素を追加
	for (int i = 0; i < 6; i++)
	{
		testStack.Push(pushData[i]);
	}

	// データを一覧表示
	testStack.Disp();
	// 改行用
	std::cout << "" << endl;
	

	// １回目
	// 要素を取り出す
	testStack.Pop();
	std::cout << "" << endl;
	// データを再度一覧表示
	testStack.Disp();
	// 改行用
	std::cout << "" << endl;


	// ２回目
	// 要素を取り出す
	testStack.Pop();
	std::cout << "" << endl;
	// データを再度一覧表示
	testStack.Disp();
}
