//============================================================
//
//  title  : データ構造（スタック） [stack.cpp]
//  Author : 原田 陽央
//   Date  : 2021/10/06
//  Update : 2021/10/11
//
//============================================================
//============================================================
//　インクルード
//============================================================
#include "stack.h"
#include "list.h"
#include "DoublyLinkedList.h"


//============================================================
//　関数
//============================================================
//------------------------------------------------------------
//　コンストラクタ
//------------------------------------------------------------
Stack::Stack()
{
	;
}


//------------------------------------------------------------
//　デストラクタ
//------------------------------------------------------------
Stack::~Stack()
{
	;
}


//------------------------------------------------------------
//　データを表示
//------------------------------------------------------------
void Stack::Disp()
{
	// 表示用の変数
	DoublyLinkedList::Node* temp = pushList.GetTopPtr();

	// エラーチェック
	if (temp == nullptr)
	{
		std::cout << "データがありません。" << std::endl;
		return;
	}
	else
	{
		std::cout << "データを表示" << endl;
	}

	// temp が NULL じゃなければデータ表示
	while (temp != nullptr)
	{
		std::cout << temp->recordData.score << "　" << temp->recordData.userName << std::endl;
		temp = temp->nextPtr;
	}
}


//------------------------------------------------------------
//　ポップ（要素を取り出す）
//------------------------------------------------------------
void Stack::Pop()
{
	// 取り出し用の変数
	DoublyLinkedList::Node* temp = pushList.GetEndPtr();

	// データを表示
	std::cout << "下記のデータを取り出しました" << endl;
	std::cout << temp->recordData.score << "　" << temp->recordData.userName << std::endl;

	// リストから末尾のデータを削除
	pushList.Remove(pushList.GetDataCount());
}


//------------------------------------------------------------
//　プッシュ（要素を追加する）
//------------------------------------------------------------
void Stack::Push(const RecordData& addRecordData)
{
	// リストにデータを追加
	pushList.AddEnd(addRecordData);
}
