//============================================================
//
//  title  : データ構造（スタック） [stack.h]
//  Author : 原田 陽央
//   Date  : 2021/10/06
//  Update : 2021/10/11
//
//============================================================
#pragma once


//============================================================
//　インクルード
//============================================================
#include <iostream>
#include <string>
#include "DoublyLinkedList.h"


using namespace std;


//============================================================
//　クラス宣言
//============================================================
class Stack
{
private:
	DoublyLinkedList pushList;

public:
	Stack();                             // コンストラクタ
	~Stack();                            // デストラクタ

	void Disp(void);                     // データを表示
	void Pop(void);                      // ポップ（要素を取り出す）
	void Push(const RecordData& addRecordData); // プッシュ（要素を追加する）
};