//============================================================
//
//  title  : データ管理 [DataManager.h]
//  Author : 原田 陽央
//   Date  : 2021/10/05
//  Update : 2021/10/05
//
//============================================================
#pragma once
#include <fstream>
#include <string>
#include "DataManager.h"
#include "list.h"


//============================================================
//　変数宣言
//============================================================
string DataManager::data;


//============================================================
//　関数
//============================================================
//------------------------------------------------------------
//　コンストラクタ
//------------------------------------------------------------
DataManager::DataManager()
{
	
}

//------------------------------------------------------------
//　デストラクタ
//------------------------------------------------------------
DataManager::~DataManager()
{

}


//------------------------------------------------------------
//　Scoresテキストファイルの読み込み
//------------------------------------------------------------
void DataManager::ReadScoreTextFile()
{
	// ファイル名を代入
	const char *fileName = "Scores.txt";

	// 読み込みに使う変数
	std::string temp;

	// ファイル読み込み
	std::ifstream ifs(fileName);

	// エラー処理（ファイルが開けない場合はreturn）
	if (!ifs)
	{
		std::cout << "ファイルが開けませんでした。" << std::endl;
		return;
	}

	// ファイルの最後まで読み込み
	while (!ifs.eof())
	{
		std::getline(ifs, temp);
		data += temp + "\n";

	}
	
#ifdef _DEBUG

	// 確認用の表示
	std::cout << data;

#endif

}


//------------------------------------------------------------
//　テキストファイルのデータからリストのデータを作成
//------------------------------------------------------------
void DataManager::LoadData()
{
	
}
